bench/results/run3-fresh-idle/wrk-container.txt
Running 30s test @ http://10.42.0.77:8080/healthz
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.12us   25.05us   3.71ms   78.82%
    Req/Sec   144.19k    41.93k  211.38k    51.00%
  Latency Distribution
     50%   45.00us
     75%   53.00us
     90%   77.00us
     99%  113.00us
  8604537 requests in 30.00s, 705.71MB read
Requests/sec: 286816.52
Transfer/sec:     23.52MB