bench/results/run3-fresh-idle/wrk-wasm.txt
Running 30s test @ http://10.42.0.76:80/healthz
  2 threads and 20 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.92ms    2.50ms  45.19ms   98.98%
    Req/Sec     5.84k     1.26k    7.88k    62.33%
  Latency Distribution
     50%    1.62ms
     75%    2.09ms
     90%    2.52ms
     99%    4.60ms
  348797 requests in 30.00s, 46.90MB read
Requests/sec:  11626.00
Transfer/sec:      1.56MB